In [3]:
import pandas as pd
exam = pd.read_csv('exam.csv')

In [6]:
# math 평균 구하기 
exam.agg(mean_math = ('math', 'mean'))

            math
mean_math  57.45

In [7]:
# 반(nclass)별로 그룹화하고, 그룹별로 변수(컬럼) math에 대한 평균(mean)을 구하고,
# 변수 이름을 mean_math로 함.
# 기본적으로 nclass가 인덱스가 됨
exam.groupby('nclass').agg(mean_math = ('math', 'mean'))

        mean_math
nclass
1           46.25
2           61.25
3           45.00
4           56.75
5           78.00

In [8]:
# 반(nclass)별로 그룹화하고,
# 그룹별로 변수(컬럼) math에 대한 평균(mean)을 구하고,
# 변수 이름을 mean_math로 함.
# nclass를 인덱스로 만들지 않음
exam.groupby('nclass', as_index = False).agg(mean_math = ('math', 'mean'))

   nclass  mean_math
0       1      46.25
1       2      61.25
2       3      45.00
3       4      56.75
4       5      78.00

In [9]:
# 반(nclass)별로 그룹화하고, 그룹별로
# mean_math 변수에 math에 대한 평균(mean) 값을
# sum_math 변수에 math에 대한 합(sum) 값을 생성함
exam.groupby('nclass') \
.agg(mean_math = ('math', 'mean'),
sum_math = ('math', 'sum'))

        mean_math  sum_math
nclass
1           46.25       185
2           61.25       245
3           45.00       180
4           56.75       227
5           78.00       312

In [11]:
# 반(nclass)별로 그룹화하고, 그룹별로
# mean_math 변수에 math에 대한 평균(mean) 값을
# sum_math 변수에 math에 대한 합(sum) 값을 생성함
# median_math 변수에 math에 대한 중앙값(median) 값을 생성함
# n 변수에 math에 대한 그룹내 개수(count) 값을 생성함
exam.groupby('nclass') \
.agg(mean_math = ('math', 'mean'),
     sum_math = ('math', 'sum'),
     median_math = ('math', 'median'),
     n = ('math', 'count')
)

        mean_math  sum_math  median_math  n
nclass
1           46.25       185         47.5  4
2           61.25       245         65.0  4
3           45.00       180         47.5  4
4           56.75       227         53.0  4
5           78.00       312         79.0  4

In [12]:
# 반(nclass)별로 그룹화하고, 그룹별로
# 각 변수에 대한 평균(mean) 값 구하기
exam.groupby('nclass').mean()

          id   math  english  science
nclass
1        2.5  46.25    94.75    61.50
2        6.5  61.25    84.25    58.25
3       10.5  45.00    86.50    39.25
4       14.5  56.75    84.75    55.00
5       18.5  78.00    74.25    83.25